In [1]:
%load_ext sql

# Self Join
- A self join is a SQL query that combines rows from the same table based on a related column within the table itself.

In [2]:
%%sql mysql://root:redhat@localhost:3306/mydb

select * from emp;

5 rows affected.

[(101, 'Pankaj', None),
 (102, 'Rahul', 104),
 (103, 'Aarti', 103),
 (104, 'Vikas', 102),
 (105, 'Raj', 101)]

In [3]:
%%sql mysql://root:redhat@localhost:3306/mydb


select e1.EmployeeID ,e1.Name as Employee_name,
e2.EmployeeID as Manager_ID ,e2.Name as Manager_name 
from Emp e1 join Emp e2 on e1.ManagerID =e2.EmployeeID;

4 rows affected.

[(102, 'Rahul', 104, 'Vikas'),
 (103, 'Aarti', 103, 'Aarti'),
 (104, 'Vikas', 102, 'Rahul'),
 (105, 'Raj', 101, 'Pankaj')]